package com.ddy.novatehttp.novatehttpdemo.config;

/**
 * Created by Administrator on 2017/11/8 0008.
 */

public class UserNameConfig {

    public static String[] surname = new String[]{
            "安", "柏", "鲍", "毕", "曹", "岑", "昌", "常", "丁", "酆", "傅", "郝"
            , "华", "姜", "解", "雷", "廉", "吕", "马", "聂", "潘", "彭", "史", "雍"
            , "汤", "陶", "滕", "邬", "许", "严", "应", "杭", "喻", "李", "仇", "李"
            , "卢", "项", "江", "万", "堪", "黎", "席", "经", "车", "贾", "裘", "赵"
            , "费", "祁", "屈", "纪", "鄂", "田", "尹", "阎", "蔡", "粱", "罗", "咎"
            , "夏", "禹", "高", "管", "穆", "汪", "骆", "周", "袁", "姚", "由", "吴"
            , "钮", "惠", "刘", "甄", "荀", "张", "孟", "於", "俞", "景", "石", "吉"
            , "薛", "符", "包", "羊", "宓", "程", "荣", "詹", "家", "崔", "封", "钱"
            , "钱", "洪", "左", "贺", "邵", "邢", "燕", "鹿", "韩", "邓", "雍", "孙"};

    public static String[] name_male = new String[]{
            "之玉", "越泽 ", "锦程 ", "修杰 ", "烨伟 ", "尔曼 ", "立辉 ", "致远 ",
            "天思 ", "友绿 ", "聪健 ", "修洁 ", "访琴 ", "初彤 ", "谷雪 ", "平灵 ",
            "源智 ", "烨华 ", "振家 ", "越彬 ", "乞 ", "子轩 ",
            "伟宸 ", "晋鹏 ", "觅松 ", "海亦 ", "戾 ", "嵩 ", "邑 ", "瑛 ", "鸿",
            "卿", "裘", "契", "涛", "疾", "驳", "凛", "逊", "鹰", "威", "紊", "阁",
            "康", "焱", "城", "誉", "祥", "虔", "胜", "穆", "豁", "匪", "霆", "凡",
            "枫", "豪", "铭", "罡", "扬", "垣", "师", "翼", "秋", "傥", "雨珍",
            "浩宇", "嘉熙", "志泽", "苑博", "念波", "峻熙", "俊驰", "聪展", "南松",
            "问旋", "黎昕", "谷波", "凝海", "靖易", "芷烟", "渊思", "煜祺", "乐驹",
            "风华", "箴", "睿渊 ", "博超 ", "天磊 ", "夜白 ", "初晴 ", "雍 ", "达 ",
            "乾 ", "鑫 ", "萧 ", "鲂 ", "冥 ", "翰"};
    public static String[] name_female = new String[]{
            "醉易",
            "紫萱",
            "紫霜",
            "紫南",
            "紫菱",
            "紫蓝",
            "紫翠",
            "紫安",
            "姿",
            "芷天",
            "芷容",
            "芷巧",
            "芷卉",
            "芷荷",
            "芷",
            "芝",
            "之桃",
            "筝",
            "真",
            "珍",
            "贞",
            "元霜",
            "元绿",
            "元槐",
            "元枫",
            "语雪",
            "语山",
            "语蓉",
            "语琴",
            "语海",
            "语芙",
            "语儿",
            "语蝶",
            "雨雪",
            "雨文",
            "雨梅",
            "雨莲",
            "雨兰",
            "幼丝",
            "幼枫",
            "又菡",
            "友梅",
            "友儿",
            "映萱",
            "映安",
            "迎梦",
            "迎波",
            "婴",
            "易巧",
            "亦丝",
            "亦巧",
            "忆雪",
            "忆文",
            "忆梅",
            "忆枫",
            "以丹",
            "依丝",
            "夜玉",
            "夜梦",
            "夜春",
            "雁荷",
            "雁风",
            "雅彤",
            "雅琴",
            "寻梅",
            "寻冬",
            "雪珍",
            "雪瑶",
            "雪旋",
            "雪卉",
            "秀",
            "笑旋",
            "笑蓝",
            "笑翠",
            "晓亦",
            "晓夏",
            "向梦",
            "香萱",
            "香岚",
            "夏真",
            "夏山",
            "夏兰",
            "惜雪",
            "惜蕊",
            "惜灵",
            "问夏",
            "问蕊",
            "问梅",
            "雯",
            "纹",
            "菀",
            "莞",
            "宛",
            "桐",
            "彤",
            "听筠",
            "听枫",
            "天曼",
            "愫"
    };


}
